Revit 2027 API
BuiltInFailures.GeneralFailures.WarningInFamilyDismissed Property
 A warning in family "[Name]" was dismissed. Please review warning information to determine if any changes are necessary\nWarning Information:\n"[Text]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WarningInFamilyDismissed { get; }
Public Shared ReadOnly Property WarningInFamilyDismissed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WarningInFamilyDismissed {
	FailureDefinitionId^ get ();
}
static member WarningInFamilyDismissed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace